<font size="+5">#01 | Data Tables & Basic Concepts of Programming</font>

- Subscribe to my [Blog â†—](https://blog.pythonassembly.com/)
- Let's keep in touch on [LinkedIn â†—](www.linkedin.com/in/jsulopz) ðŸ˜„

# Define a Variable

> Asign an `object` (numbers, text) to a `variable`.

In [2]:
a=1

In [4]:
texto = frase

NameError: name 'frase' is not defined

In [5]:
frase = 89

In [6]:
texto = frase

# The Registry (_aka The Environment_)

> Place where Python goes to **recognise what we type**.

In [12]:
type(78)

int

In [13]:
type(34.43)

float

In [14]:
type('joaidfs')

str

In [15]:
len

In [16]:
sum

In [17]:
a = [34,3,5365]

In [19]:
import pandas as pepa

In [21]:
s = pepa.Series(a)

In [24]:
s.mean()

1800.6666666666667

In [25]:
type(s)

pandas.core.series.Series

In [26]:
type(a)

list

In [23]:
a.m

[34, 3, 5365]

# Use of Functions

## Predefined Functions in Python (_Built-in_ Functions)

> https://docs.python.org/3/library/functions.html

In [18]:
a.mean()

AttributeError: 'list' object has no attribute 'mean'

In [27]:
mean(a)

NameError: name 'mean' is not defined

In [28]:
sum(a)

5402

## Discipline to Search Solutions in Google

> Apply the following steps when **looking for solutions in Google**:
>
> 1. **Necesity**: How to load an Excel in Python?
> 2. **Search in Google**: by keywords
>   - `load excel python`
>   - ~~how to load excel in python~~
> 3. **Solution**: What's the `function()` that loads an Excel in Python?
>   - A Function to Programming is what the Atom to Phisics.
>   - Every time you want to do something in programming
>   - **You will need a `function()`** to make it
>   - Theferore, you must **detect parenthesis `()`**
>   - Out of all the words that you see in a website
>   - Because they indicate the presence of a `function()`.

## External Functions

> Download [this Excel](https://github.com/sotastica/data/raw/main/internet_usage_spain.xlsx).
> Apply the above discipline and make it happen ðŸš€
> I want to see the table, c'mon ðŸ‘‡

In [30]:
import pandas as pd

In [38]:
pd.read_excel(io="internet_usage_spain.xlsx",sheet_name='internet_usage')

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [35]:
pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1)

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

## The Elements of Programming

> - `Library`: where the code of functions are stored.
>   - `Function`: execute several lines of code with one `word()`.
>       - `Parameter`: to **configure** the function's behaviour.
>           - `Object`: **data structure** to store information.

In [39]:
df

NameError: name 'df' is not defined

## Code Syntax

**What happens inside the computer when we run the code?**

> In which order Python reads the line of code?
> - From left to right.
> - From up to down.
> Which elements are being used in the previous line of code?

In [42]:
fit()

NameError: name 'fit' is not defined

In [43]:
algo.fit()

NameError: name 'algo' is not defined

`algo = ?`

In [44]:
algo = LinearRegression()

NameError: name 'LinearRegression' is not defined

In [45]:
from sklearn.linear_model import LinearRegression

In [47]:
from sklearn.ensemble import RandomForestClassifier

In [48]:
rf = RandomForestClassifier()

In [ ]:
rf.fit

In [46]:
algo = LinearRegression()

In [ ]:
algo.

In [ ]:
pd.

In [53]:
'holaq ue tal'.split()

['holaq', 'ue', 'tal']

1. `libreria`
2. `.` **DOT NOTATION** para acceder dentro de la libreria a las funciones u otras cosas...
3. `funcion()`
4. pasamos `objetos` a los `argumentos`
5. ejecutamos
6. 
7. la funcion te devuelve un `objeto`

In [50]:
type("internet_usage_spain.xlsx")

str

In [52]:
pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1)

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [54]:
pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1).mean()

/var/folders/24/tg28vxls25l9mjvqrnh0plc80000gn/T/ipykernel_94682/3527767804.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1).mean()

internet_usage     0.535642
age               46.798778
dtype: float64

In [55]:
df = pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1)

In [56]:
df.mean()

/var/folders/24/tg28vxls25l9mjvqrnh0plc80000gn/T/ipykernel_94682/3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

internet_usage     0.535642
age               46.798778
dtype: float64

In [59]:
df = pd.read_excel(io="internet_usage_spain.xlsx",sheet_name=1)

In [61]:
df.mean(numeric_only=True)

internet_usage     0.535642
age               46.798778
dtype: float64

## Functions inside Objects

> - The `dog` makes `guau()`: `dog.guau()`
> - The `cat` makes `miau()`: `cat.miau()`
> - What could a `DataFrame` make? `object.` + `[tab key]`

In [66]:
type(df)

pandas.core.frame.DataFrame

In [68]:
type(df.describe())

pandas.core.frame.DataFrame

In [71]:
df.describe().sum().mean()

2614.328699627561

In [72]:
df.describe().sum().mean().describe()

AttributeError: 'numpy.float64' object has no attribute 'describe'

In [73]:
a = 89

In [74]:
a

89

## Conclusion | Types of Functions

> 1. Buit-in (Predefined) Functions
> 2. External Functions from Libraries
> 3. Functions within Objects

In [77]:
df.education.count()

2455

In [78]:
df.education.value_counts()

Elementary      1184
Higher Level     374
High School      279
PhD              236
University       205
No studies       177
Name: education, dtype: int64

# Accessing `Objects`

> Objects are **data structures** that store information. 
> Which **syntax** do we use to access the information?

## Dot Notation `.`

In [82]:
df

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [81]:
df.education

0        Elementary
1        Elementary
2        University
3               PhD
4               PhD
           ...
2450     Elementary
2451    High School
2452     Elementary
2453    High School
2454     Elementary
Name: education, Length: 2455, dtype: object

## Square Brackets `[]`

In [84]:
df['education'].value_counts()

Elementary      1184
Higher Level     374
High School      279
PhD              236
University       205
No studies       177
Name: education, dtype: int64

# Filter & Masking

## mayores de 70 anos

In [90]:
df['age']

0       66
1       72
2       48
3       59
4       44
        ..
2450    43
2451    18
2452    54
2453    31
2454    52
Name: age, Length: 2455, dtype: int64

In [92]:
type(df["age"]>70)

pandas.core.series.Series

In [94]:
mask = df["age"]>70

In [95]:
mask

0       False
1        True
2       False
3       False
4       False
        ...
2450    False
2451    False
2452    False
2453    False
2454    False
Name: age, Length: 2455, dtype: bool

In [97]:
df

      internet_usage     sex  age    education
0                  0  Female   66   Elementary
1                  1    Male   72   Elementary
2                  1    Male   48   University
3                  0    Male   59          PhD
4                  1  Female   44          PhD
...              ...     ...  ...          ...
2450               1    Male   43   Elementary
2451               1  Female   18  High School
2452               0  Female   54   Elementary
2453               1    Male   31  High School
2454               0    Male   52   Elementary

[2455 rows x 4 columns]

In [96]:
df[mask]

      internet_usage     sex  age   education
1                  1    Male   72  Elementary
10                 0  Female   73  Elementary
14                 0    Male   79  No studies
21                 0  Female   84  Elementary
50                 0  Female   90  Elementary
...              ...     ...  ...         ...
2436               0    Male   82  Elementary
2439               0    Male   74  Elementary
2440               0  Female   77  Elementary
2443               0  Female   80  Elementary
2449               0    Male   92  No studies

[303 rows x 4 columns]

## sin estudios

In [99]:
sinestudios = df.education=="No studies"

In [101]:
df[sinestudios]

      internet_usage     sex  age   education
14                 0    Male   79  No studies
28                 0    Male   70  No studies
33                 0  Female   65  No studies
51                 0    Male   79  No studies
70                 0  Female   76  No studies
...              ...     ...  ...         ...
2398               0  Female   78  No studies
2401               0    Male   61  No studies
2405               0  Female   81  No studies
2448               0  Female   64  No studies
2449               0    Male   92  No studies

[177 rows x 4 columns]

## mayores de 70 y sin estudios

In [106]:
mask & sinestudios

0       False
1       False
2       False
3       False
4       False
        ...
2450    False
2451    False
2452    False
2453    False
2454    False
Length: 2455, dtype: bool

In [103]:
df[mask & sinestudios]

      internet_usage     sex  age   education
14                 0    Male   79  No studies
51                 0    Male   79  No studies
70                 0  Female   76  No studies
71                 0    Male   74  No studies
95                 0    Male   73  No studies
...              ...     ...  ...         ...
2313               0  Female   80  No studies
2397               0    Male   82  No studies
2398               0  Female   78  No studies
2405               0  Female   81  No studies
2449               0    Male   92  No studies

[100 rows x 4 columns]

## mayores de 70 o sin estudios

In [104]:
df[mask | sinestudios]

      internet_usage     sex  age   education
1                  1    Male   72  Elementary
10                 0  Female   73  Elementary
14                 0    Male   79  No studies
21                 0  Female   84  Elementary
28                 0    Male   70  No studies
...              ...     ...  ...         ...
2439               0    Male   74  Elementary
2440               0  Female   77  Elementary
2443               0  Female   80  Elementary
2448               0  Female   64  No studies
2449               0    Male   92  No studies

[380 rows x 4 columns]

In [105]:
df[mask or sinestudios]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().